p = 57896044630612021680684936114742422271145183870487080309667128995208157569947
q = 28948022315306010840342468057371211135571302038761442251594012761075345324491
a = 1
b = 19750513962881385028059495396984460236743646692126413053976069443380491067343

D = 31
ok = True

for t in range(1, D + 1):
    val = pow(p, t, q)
    print(f"t = {t:2d}: p^t mod q = {val}")
    if val == 1:
        ok = False
        print(f"НАРУШЕНО при t = {t}")

if ok:
    print("Условие выполнено: p^t != 1 (mod q) для всех t = 1..31")
else:
    print("Условие НЕ выполнено")
