import sys
from math import gcd


# для разложения e/n в цепную дробь
# пример разложения:
# Выделяем целую часть:
# 43/19 = 2 + 5/19
# Значит a₀ = 2.
# Остаток 5/19 переворачиваем:
# 5/19 = 1/(19/5)
# Получаем:
# 43/19 = 2 + 1/(19/5)
# Теперь работаем с дробью 19/5.
def continued_fraction(num, den):
    """Цепная дробь для num/den: [a0; a1, a2, ...]."""
    cf = []
    while den:
        q = num // den  # 43 / 19 = 2 + 5/19; q <- 2
        cf.append(q)
        # num <- 19; den <- 43 - 2 * 19 = 5
        num, den = den, num - q * den

    print(f"Коэффициенты цепной дроби: {cf}")
    return cf


# α = a₀ + 1/(a₁ + 1/(a₂ + 1/(a₃ + ...)))
# Подходящая дробь P_i/Q_i — это то, что получается,
# если оборвать цепную дробь на i-м элементе
# P₀/Q₀ = a₀
# P₁/Q₁ = a₀ + 1/a₁
# P₂/Q₂ = a₀ + 1/(a₁ + 1/a₂)
# ...
def convergents(cf):
    """Подходящие дроби P_i/Q_i для цепной дроби cf."""

    # Начальные условия по методичке:
    # P_{-1}=1, Q_{-1}=0, P_0=0, Q_0=1
    p_prev2, p_prev1 = 0, 1
    q_prev2, q_prev1 = 1, 0

    for a in cf:
        # Рекуррентные формулы подходящих дробей:
        #   P_i = a_i * P_{i-1} + P_{i-2}
        #   Q_i = a_i * Q_{i-1} + Q_{i-2}
        p = a * p_prev1 + p_prev2
        q = a * q_prev1 + q_prev2
        yield p, q
        p_prev2, p_prev1 = p_prev1, p
        q_prev2, q_prev1 = q_prev1, q


def wiener_attack(n, e):
    """Атака Винера. Возвращает d или None."""

    # разложение e,n в цепную дробь
    cf = continued_fraction(e, n)

    # идем по подходящим дробям
    for k, d in convergents(cf):

        if d == 0:
            continue
        if k == 0:
            continue

        print(f"Подходящая дробь (k/d): {k}/{d}")

        # и проверка через расшифрование просто, т.е. берется какое то
        # сообщение, зашифровывается и если далее корректно
        # расшифровалось то все ок

        # проверка: (m^e)^d ≡ m (mod n)
        m = 2
        if pow(pow(m, e, n), d, n) == m % n:
            print ("Проверка (m^e)^d ≡ m (mod n) пройдена, d найден")
            return d

    return None


# python3 wiener.py 135500873554643875002806215483549329999778558582066024516617219257820244473643623125033562403023329148579482869336227692655681932361339430602190334559680132238309319034085163192839127646013709026649891818111147322576762740829064345307336200428311824824482196068851251057207419004943197621130269162181550911947 115381201466408055139679810937010661894687005976025005819153986067493503626348315332803284771214794674217472743070358921165108019923952051161314408739239022977272143909377684394535624269980970706749808526202389334610349826143025686695029152524020978484398780561991765892084757242840845222641150942382122091831
def main():
    if len(sys.argv) != 3:
        print("Использование: python3 wiener.py <n> <e>")
        return

    n = int(sys.argv[1])
    e = int(sys.argv[2])

    d = wiener_attack(n, e)
    print(f"d = {d}")


if __name__ == '__main__':
    main()
